print(
    '''
    Есть список из случайных чисел и строк. Создайте цикл, итерирующийся до тех пор, пока не встретится число "777".
    Если в течении 100 попыток число не будет найдено — остановить цикл и вызвать ошибку с соответсвующим сообщением.
   
    ''')

random_list = [1, '25', 25, 100, ]
random_list2 = [1, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 'for', 5, 1, '25', 25, 77, 10, 8, '562sdc', 771,
                8, 'red', 'for', 5, 1, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 'for', 5, 1, '25', 25, 77, 10, 8,
                '562sdc', 771, 8, 'red', 'for', 51, '25', 25, 77, 10, 8, '562sdc', 100, 771, 8, 'red', 'for', 51, '25',
                25,
                77, 10, 8, '562sdc', 771, 8, 'red', 'for', 51, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 'for', 51,
                '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 'for', 51, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red',
                'for', 51, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 'for', 51, '25', 25, 77, 10, 8, '562sdc', 771,
                8, 'red', 'for', 51, '25', 25, 77, 10, 8, '562sdc', 771, 8, 'red', 688, 'for', 51, '25', 25, 77, 10, 8,
                10
                ]


def number_search(lists, number):
    i = 0
    for x in lists:
        i += 1
        if x == number:
            print(f'Попытка № {i}. Ура! Это чиcло {x} мы его наконец-то нашли, не прошло и 100 попыток')
            break
        elif i >= 100:
            print(f'Попытка №{i}')
            print(f'Число {number} в списке не найдено. Больше 100 попыток нельзя.')
            break
        elif x != number and len(lists) == i:
            print(f'Попытка №{i}')
            print(f'В этом списке {len(lists)}  елементов и среди них нет цифры {number}')
            break


number_search(random_list, 777)
